<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"0b9a03728fa6403ab7bca89ea0b71e62235d3f14496d0a8dd2adddf01867fc4f","plan_job_ref":"Job Plan Airflow DAGs #158 at https://github.com/cal-itp/data-infra/actions/runs/16006887007","plan_out_hash":"c659c15bcc2068c5a77cc3bd00b68770472bb70b74e1c6dc336c16ad1e68f9a7","plan_hash":"71c4792b861d1edf85889e444147b79ee7265e71a6d24d8e1c068d90cb5eaf0c","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 20 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/deploy_dbt_docs/deploy_dbt_docs_site.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "1TjLhg==" -> (known after apply)
!~      detect_md5hash      = "de0d86t5X/4i6leCooLtag==" -> "different hash"
!~      generation          = 1751387626807322 -> (known after apply)
        id                  = "calitp-staging-composer-dags/deploy_dbt_docs/deploy_dbt_docs_site.yml"
!~      md5hash             = "de0d86t5X/4i6leCooLtag==" -> (known after apply)
        name                = "dags/deploy_dbt_docs/deploy_dbt_docs_site.yml"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/parse_and_validate_rt_v2/parse_rt_service_alerts.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "zKttag==" -> (known after apply)
!~      detect_md5hash      = "Xe9dt90ZRH7UMJBlh9ozLw==" -> "different hash"
!~      generation          = 1751385772588093 -> (known after apply)
        id                  = "calitp-staging-composer-dags/parse_and_validate_rt_v2/parse_rt_service_alerts.yml"
!~      md5hash             = "Xe9dt90ZRH7UMJBlh9ozLw==" -> (known after apply)
        name                = "dags/parse_and_validate_rt_v2/parse_rt_service_alerts.yml"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/parse_and_validate_rt_v2/parse_rt_trip_updates.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "5rmJng==" -> (known after apply)
!~      detect_md5hash      = "1tLGAtDgVy7lGk/hM4CvOQ==" -> "different hash"
!~      generation          = 1751385772932980 -> (known after apply)
        id                  = "calitp-staging-composer-dags/parse_and_validate_rt_v2/parse_rt_trip_updates.yml"
!~      md5hash             = "1tLGAtDgVy7lGk/hM4CvOQ==" -> (known after apply)
        name                = "dags/parse_and_validate_rt_v2/parse_rt_trip_updates.yml"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/parse_and_validate_rt_v2/parse_rt_vehicle_positions.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "ZpmXmw==" -> (known after apply)
!~      detect_md5hash      = "brtCH0sABPSEnBvC+uxf2g==" -> "different hash"
!~      generation          = 1751385772911743 -> (known after apply)
        id                  = "calitp-staging-composer-dags/parse_and_validate_rt_v2/parse_rt_vehicle_positions.yml"
!~      md5hash             = "brtCH0sABPSEnBvC+uxf2g==" -> (known after apply)
        name                = "dags/parse_and_validate_rt_v2/parse_rt_vehicle_positions.yml"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/parse_and_validate_rt_v2/validate_rt_service_alerts.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "0zAI+w==" -> (known after apply)
!~      detect_md5hash      = "FK0HSViih0QUSvuHliFIUQ==" -> "different hash"
!~      generation          = 1751385772589161 -> (known after apply)
        id                  = "calitp-staging-composer-dags/parse_and_validate_rt_v2/validate_rt_service_alerts.yml"
!~      md5hash             = "FK0HSViih0QUSvuHliFIUQ==" -> (known after apply)
        name                = "dags/parse_and_validate_rt_v2/validate_rt_service_alerts.yml"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/parse_and_validate_rt_v2/validate_rt_trip_updates.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "j7RASg==" -> (known after apply)
!~      detect_md5hash      = "tCdkFtJO3TtBk8XUuTsJPw==" -> "different hash"
!~      generation          = 1751385772593872 -> (known after apply)
        id                  = "calitp-staging-composer-dags/parse_and_validate_rt_v2/validate_rt_trip_updates.yml"
!~      md5hash             = "tCdkFtJO3TtBk8XUuTsJPw==" -> (known after apply)
        name                = "dags/parse_and_validate_rt_v2/validate_rt_trip_updates.yml"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/parse_and_validate_rt_v2/validate_rt_vehicle_positions.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "r3ZutQ==" -> (known after apply)
!~      detect_md5hash      = "JYsPs9P1vL4JLqDW9qQZbA==" -> "different hash"
!~      generation          = 1751385772587444 -> (known after apply)
        id                  = "calitp-staging-composer-dags/parse_and_validate_rt_v2/validate_rt_vehicle_positions.yml"
!~      md5hash             = "JYsPs9P1vL4JLqDW9qQZbA==" -> (known after apply)
        name                = "dags/parse_and_validate_rt_v2/validate_rt_vehicle_positions.yml"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/publish_open_data/publish_california_open_data.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "3vd8YA==" -> (known after apply)
!~      detect_md5hash      = "+pP0qqeF+323JUqSlNfIUw==" -> "different hash"
!~      generation          = 1751385772971447 -> (known after apply)
        id                  = "calitp-staging-composer-dags/publish_open_data/publish_california_open_data.yml"
!~      md5hash             = "+pP0qqeF+323JUqSlNfIUw==" -> (known after apply)
        name                = "dags/publish_open_data/publish_california_open_data.yml"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/scrape_feed_aggregators/scrape_mobility_database.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "H5zr8w==" -> (known after apply)
!~      detect_md5hash      = "4rR7jFP5qlk+BUfubg0SBQ==" -> "different hash"
!~      generation          = 1751385772582863 -> (known after apply)
        id                  = "calitp-staging-composer-dags/scrape_feed_aggregators/scrape_mobility_database.yml"
!~      md5hash             = "4rR7jFP5qlk+BUfubg0SBQ==" -> (known after apply)
        name                = "dags/scrape_feed_aggregators/scrape_mobility_database.yml"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/scrape_feed_aggregators/scrape_transitland.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "Qhrpmw==" -> (known after apply)
!~      detect_md5hash      = "Ni8ibGghhejE+H2vzgMPVw==" -> "different hash"
!~      generation          = 1751385772776908 -> (known after apply)
        id                  = "calitp-staging-composer-dags/scrape_feed_aggregators/scrape_transitland.yml"
!~      md5hash             = "Ni8ibGghhejE+H2vzgMPVw==" -> (known after apply)
        name                = "dags/scrape_feed_aggregators/scrape_transitland.yml"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse/dbt_run_and_upload_artifacts.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "RRf5BQ==" -> (known after apply)
!~      detect_md5hash      = "yKBxQQD0sgnLITGc63O9tw==" -> "different hash"
!~      generation          = 1751387626814343 -> (known after apply)
        id                  = "calitp-staging-composer-dags/transform_warehouse/dbt_run_and_upload_artifacts.yml"
!~      md5hash             = "yKBxQQD0sgnLITGc63O9tw==" -> (known after apply)
        name                = "dags/transform_warehouse/dbt_run_and_upload_artifacts.yml"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse/dbt_test.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "iLJBag==" -> (known after apply)
!~      detect_md5hash      = "aB1prSvKK4XjE6bGuB6v8g==" -> "different hash"
!~      generation          = 1751387627023305 -> (known after apply)
        id                  = "calitp-staging-composer-dags/transform_warehouse/dbt_test.yml"
!~      md5hash             = "aB1prSvKK4XjE6bGuB6v8g==" -> (known after apply)
        name                = "dags/transform_warehouse/dbt_test.yml"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse_full_refresh/dbt_run_and_upload_artifacts.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "Wt4nvw==" -> (known after apply)
!~      detect_md5hash      = "uHJm4SNugs5VbX3Vg8hBsg==" -> "different hash"
!~      generation          = 1751387626812311 -> (known after apply)
        id                  = "calitp-staging-composer-dags/transform_warehouse_full_refresh/dbt_run_and_upload_artifacts.yml"
!~      md5hash             = "uHJm4SNugs5VbX3Vg8hBsg==" -> (known after apply)
        name                = "dags/transform_warehouse_full_refresh/dbt_run_and_upload_artifacts.yml"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse_full_refresh/dbt_test.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "C3Ffdg==" -> (known after apply)
!~      detect_md5hash      = "lZMXR2OY8ImBw7o7Ghdspg==" -> "different hash"
!~      generation          = 1751387626798189 -> (known after apply)
        id                  = "calitp-staging-composer-dags/transform_warehouse_full_refresh/dbt_test.yml"
!~      md5hash             = "lZMXR2OY8ImBw7o7Ghdspg==" -> (known after apply)
        name                = "dags/transform_warehouse_full_refresh/dbt_test.yml"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_full_refresh_exclude_rt.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "grqY4Q==" -> (known after apply)
!~      detect_md5hash      = "MeUW6Tgv0gxfeH8mbnVd+Q==" -> "different hash"
!~      generation          = 1751387626812319 -> (known after apply)
        id                  = "calitp-staging-composer-dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_full_refresh_exclude_rt.yml"
!~      md5hash             = "MeUW6Tgv0gxfeH8mbnVd+Q==" -> (known after apply)
        name                = "dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_full_refresh_exclude_rt.yml"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_select_rt.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "ObsELw==" -> (known after apply)
!~      detect_md5hash      = "mTRn2cmb1axpjJ2a/AKAVQ==" -> "different hash"
!~      generation          = 1751387626806663 -> (known after apply)
        id                  = "calitp-staging-composer-dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_select_rt.yml"
!~      md5hash             = "mTRn2cmb1axpjJ2a/AKAVQ==" -> (known after apply)
        name                = "dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_select_rt.yml"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse_full_refresh_sunday/dbt_test_exclude_rt.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "/OTJ3A==" -> (known after apply)
!~      detect_md5hash      = "iQ5C+BoSY1UfVmQZDKwcqg==" -> "different hash"
!~      generation          = 1751387626806699 -> (known after apply)
        id                  = "calitp-staging-composer-dags/transform_warehouse_full_refresh_sunday/dbt_test_exclude_rt.yml"
!~      md5hash             = "iQ5C+BoSY1UfVmQZDKwcqg==" -> (known after apply)
        name                = "dags/transform_warehouse_full_refresh_sunday/dbt_test_exclude_rt.yml"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse_full_refresh_sunday/dbt_test_select_rt.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "VHCbuA==" -> (known after apply)
!~      detect_md5hash      = "ebeCIonPmd2zIeayV4ifjg==" -> "different hash"
!~      generation          = 1751387626823058 -> (known after apply)
        id                  = "calitp-staging-composer-dags/transform_warehouse_full_refresh_sunday/dbt_test_select_rt.yml"
!~      md5hash             = "ebeCIonPmd2zIeayV4ifjg==" -> (known after apply)
        name                = "dags/transform_warehouse_full_refresh_sunday/dbt_test_select_rt.yml"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/unzip_and_validate_gtfs_schedule_hourly/validate_gtfs_schedule.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "gXvXtg==" -> (known after apply)
!~      detect_md5hash      = "qB4N5YSblt/zrFnXZ7nb8A==" -> "different hash"
!~      generation          = 1751385772856614 -> (known after apply)
        id                  = "calitp-staging-composer-dags/unzip_and_validate_gtfs_schedule_hourly/validate_gtfs_schedule.yml"
!~      md5hash             = "qB4N5YSblt/zrFnXZ7nb8A==" -> (known after apply)
        name                = "dags/unzip_and_validate_gtfs_schedule_hourly/validate_gtfs_schedule.yml"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-partial_parse will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-partial_parse" {
        id                  = "calitp-staging-composer-data/warehouse/target/partial_parse.msgpack"
        name                = "data/warehouse/target/partial_parse.msgpack"
#        (20 unchanged attributes hidden)
    }

Plan: 0 to add, 20 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #158](https://github.com/cal-itp/data-infra/actions/runs/16006887007)